In [3]:
import pandas as pd
from pandasql import sqldf as psql

In [4]:
df1=pd.read_csv("df1", sep="\t")
df2=pd.read_csv("df2", sep="\t")
df3=pd.read_csv("df3", sep="\t")

In [5]:
print(df1)
print(df2)
print(df3)

   Seq1.id  Seq2.id
0  seq1.01  seq5.02
1  seq2.01  Seq6.02
2  seq3.01  Seq7.02
3  seq4.01  Seq8.02
  Seq.1.id
0  seq1.01
1  seq2.01
2  seq4.01
  Seq.2.id
0  seq5.02
1  Seq6.02
2  Seq7.02

In [6]:
psql('select [Seq1.id],[Seq2.id] from df1 inner join df2 on df1.[Seq1.id]=df2.[Seq.1.id] inner join df3 on df1.[Seq2.id]=df3.[Seq.2.id]')

   Seq1.id  Seq2.id
0  seq1.01  seq5.02
1  seq2.01  Seq6.02

In [9]:
frames = [df1, df2, df3]

In [10]:
frames

[   Seq1.id  Seq2.id
 0  seq1.01  seq5.02
 1  seq2.01  Seq6.02
 2  seq3.01  Seq7.02
 3  seq4.01  Seq8.02,   Seq.1.id
 0  seq1.01
 1  seq2.01
 2  seq4.01,   Seq.2.id
 0  seq5.02
 1  Seq6.02
 2  Seq7.02]

In [12]:
 pd.concat(frames,join='inner', axis=1)

   Seq1.id  Seq2.id Seq.1.id Seq.2.id
0  seq1.01  seq5.02  seq1.01  seq5.02
1  seq2.01  Seq6.02  seq2.01  Seq6.02
2  seq3.01  Seq7.02  seq4.01  Seq7.02

In [19]:
df1.merge(df2, left_on='Seq1.id', right_on='Seq.1.id', sort=True, how='inner').merge(df3,left_on='Seq2.id', right_on='Seq.2.id',sort=True, how="inner").loc[:,"Seq1.id":"Seq2.id"]

   Seq1.id  Seq2.id
0  seq2.01  Seq6.02
1  seq1.01  seq5.02